app/views/movies/_form.html.erb

      <%= label_tag 'series', 'Select Series' %>
      <%= select_tag 'series', options_from_collection_for_select(Series.all, :id, :title), include_blank: true, onchange: "$('#series_change').submit();", class: "form-control" %>
---
SELECT "series".* FROM "series"