app/controllers/favorites_controller.rb

  def create
    @video = Video.find(params[:movie_id])
    favorite = current_user.favorites.build(video: @video)

    if favorite.save
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "favorites" ("video_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["video_id", 1], ["user_id", 1], ["created_at", "2016-03-30 16:11:49.132568"], ["updated_at", "2016-03-30 16:11:49.132568"]]

  def destroy
    # raise params.inspect
    @video = Video.find(params[:movie_id])
    favorite = current_user.favorites.find(params[:id])
    # raise favorite.inspect

    if favorite.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]