app/controllers/movies_controller.rb

INSERT INTO "videos" ("title", "year", "synopsis", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rxkudosa"], ["year", 2007], ["synopsis", "Lpyj toxs kztchos sap zehtun pgwjr jesui."], ["created_at", "2016-03-25 12:38:49.958751"], ["updated_at", "2016-03-25 12:38:49.958751"]]
---
  def create
    # raise params.inspect
    # if params[:video][:series].present?
    #   @series = Series.create(params[:video][:series])
    # end
    # if params[:video][:season].present?
    #   @season = @series.seasons.create(params[:video][:season])
    # end
    @video = Video.new(video_params)
    # @video.season = @season
    authorize @video

    if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @video = Video.find(params[:id])

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "videos" SET "title" = ?, "language" = ?, "year" = ?, "synopsis" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["title", "video 4"], ["language", 1], ["year", 2013], ["synopsis", "video 4 text"], ["updated_at", "2016-03-29 13:09:47.299084"], ["id", 4]]
---
  def update
    @video = Video.find(params[:id])
    @video.assign_attributes(video_params)

    if @video.save

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 5]]
---
  def destroy
    @video = Video.find(params[:id])
    authorize @video

    if @video.destroy