app/controllers/seasons_controller.rb

  def index
    if params[:series].present?
      @series = Series.find(params[:series])
---
SELECT  "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", 1]]