app/controllers/users_controller.rb

  def index
    if params[:approved] == "false"
      @users = User.find_all_by_approved(false)
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."approved" = ?  [["approved", "f"]]
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])
    @user.assign_attributes(user_params)

    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "email" = ?, "reset_password_token" = ?, "reset_password_sent_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "luise.rauch2@gmai.com"], ["reset_password_token", nil], ["reset_password_sent_at", nil], ["updated_at", "2016-04-01 15:43:38.082689"], ["id", 3]]

  def show
    @user = current_user
    @user_favorited_videos = @user.favorites.collect(&:video)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."video_id" = ?  ORDER BY "favorites"."id" ASC LIMIT 1  [["user_id", 1], ["video_id", 11]]